Hidroponic-UMN/iot-hydroponic-esp32/lib/main-code-rack/main-code-rack.cpp
// ============================================================
//  ★ IMPROVED TDS CONVERSION ★
//  Uses two-point calibration (slope + offset)
// ============================================================
float averageTDSVoltage() {
  int sampling_number = 10;
  float total_comp_vol = 0;

  for (int i = 1; i <= sampling_number ; i++) {
    delay(60);
    float temperature = watertemp.getTempCByIndex(0);
    int raw_tds = analogRead(TDS_PIN);
    // Convert ADC to voltage
    float voltage = rawToVoltage(raw_tds);

    // Temperature compensation
    float compensationCoefficient = 1.0 + 0.02 * (temperature - 25.0);
    float compensationVoltage = voltage / compensationCoefficient;
    total_comp_vol += compensationVoltage;
  }
  total_comp_vol = total_comp_vol / sampling_number;
  return total_comp_vol;
}

float convertToTDS() {
  float compensationVoltage = averageTDSVoltage();
  Serial.print("TDS Voltage: ");
  Serial.println(compensationVoltage);
  float tds_base = (133.42 * compensationVoltage * compensationVoltage * compensationVoltage
                      - 255.86 * compensationVoltage * compensationVoltage
                      + 857.39 * compensationVoltage) * 0.5;
  float real_tds = (tds_cal.slope * tds_base) + tds_cal.offset;
  return real_tds;
}

// ============================================================
// Read Current Flow Rate (L/min)
// ============================================================
float readFlowRate() {
  // Read current pulse count
  uint32_t currentPulses = pulseCount;
  Serial.print("Pulse Count: ");
  Serial.println(pulseCount);

  // Calculate volume from pulses
  float volume = currentPulses / FLOW_CALIBRATION_FACTOR;

  // Calculate time elapsed in minutes
  unsigned long elapsedTime = millis() - flowStartTime;
  float elapsedMinutes = elapsedTime / 60000.0;  // Convert milliseconds to minutes

  // Avoid division by zero
  if (elapsedMinutes < 0.001) {
    return 0.0;
  }

  // Flow rate = Volume / Time
  flowRate = volume / elapsedMinutes;
  return flowRate;
}

// ============================================================
// Reset Flow Measurement
// Call this to start a new flow measurement
// ============================================================
void resetFlowMeasurement() {
  pulseCount = 0;
  totalVolume = 0.0;
  flowRate = 0.0;
  flowStartTime = millis();
  lastPulseTime = millis();
}


float readUltraSonicSensor() {
  // Send 10µs pulse on trigger pin
  digitalWrite(US_TRIG_PIN, LOW);
  delayMicroseconds(4);  // Ensure LOW for at least 2µs

  digitalWrite(US_TRIG_PIN, HIGH);
  delayMicroseconds(10);  // HIGH for 10µs
  digitalWrite(US_TRIG_PIN, LOW);

  // Measure the duration of the echo pulse
  // pulseIn() waits for pin to go HIGH, then measures how long it stays HIGH
  unsigned long echoPulse = pulseIn(US_ECHO_PIN, HIGH, ECHO_TIMEOUT);

  if (echoPulse == 0) {
    Serial.println("Error: No echo received (timeout)");
    return 0.0;
  }

  // Calculate distance using the echo pulse width
  // Distance (cm) = (Echo_time_in_µs / 2) * speed_of_sound_in_cm/µs
  // Divided by 2 because sound travels to object AND back
  float distance_in_cm = (echoPulse / 2.0) * SOUND_SPEED;
  if (distance_in_cm < 2.0 || distance_in_cm > 450.0) {
    Serial.printf("Warning: Distance out of range: %.2f cm\n", distance_in_cm);
    return 0.0;
  }
  return distance_in_cm;
}

float readUltraSonicSensorAverage() {
  float distanceSum = 0;
  uint8_t count = 0;

  float tmp = 0.0;
  for (uint8_t i=1;i<=10;i++) {
    delay(60);
    tmp = readUltraSonicSensor();
    if (tmp != 0.0) {
      distanceSum += tmp;
      count++;
    }
  }

  if (count > 0) {
    distanceSum = (distanceSum / (float)count);
    Serial.print("Distance in average: ");
    Serial.println(distanceSum);
    float distanceInCM = TANDON_HEIGHT_FROM_US_SENSOR - distanceSum;
    return distanceInCM;
  } else {
    Serial.println("❌ No valid ultrasonic readings!");
    return 0.0;  // Return 0 instead of dividing by zero
  }
}

float readLightIntensity() {
  // Try to read from BH1750
  float lux = luxmeter.readLightLevel();

  // BH1750 returns 65535 or < 0 on error or if not configured
  if (lux == 65535.0 || lux < 0.0) {
    Serial.println("⚠️ BH1750 reading error - check sensor connection");
    return -1.0;  // Return -1 to indicate error
  }

  return lux;
}


// ============================================================
//  ★ IMPROVED pH CALIBRATION ★
//  Supports both one-point and two-point calibration
// ============================================================
bool calibratePH(float known_ph_value, float known_voltage = -1) {
  Serial.println("\n🧪 Starting pH Calibration...");
  Serial.printf("   Target pH: %.2f\n", known_ph_value);
  Serial.printf("   Current calibration points: %d\n", ph_cal.num_points);
  Serial.println("   Taking readings...");

  float voltage = readADCFilterVoltage(PH_PIN);
  if (known_voltage != -1) {
    voltage = known_voltage;
  }
  float base_ph = (voltage * ph_cal.slope) + ph_cal.offset;

  Serial.printf("   Voltage: %.3f mV\n", voltage);
  Serial.printf("   Base pH (uncalibrated): %.2f\n", base_ph);

  // Determine if this is first or second calibration point
  if (ph_cal.num_points == 0 || known_ph_value == 4.0) {
    Serial.println("   → Setting as calibration point 1");

    ph_cal.point1_voltage = voltage;
    ph_cal.point1_ph = known_ph_value;
    ph_cal.num_points = 1;

    Serial.printf("   One-point calibration applied\n");
    Serial.printf("   Offset: %.3f\n", ph_cal.offset);

  } else if (ph_cal.num_points == 1 || known_ph_value == 7.0) {
    Serial.println("   → Setting as calibration point 2");

    if (abs(known_ph_value - ph_cal.point1_ph) < 1.0) {
      Serial.println("⚠️ Warning: Calibration points should be at least 1 pH unit apart!");
      Serial.println("   (Recommended: pH 4 and pH 7, or pH 7 and pH 10)");
    }

    ph_cal.point2_voltage = voltage;
    ph_cal.point2_ph = known_ph_value;
    ph_cal.num_points = 2;

    ph_cal.is_calibrated = true;
    Serial.println("   Two-point calibration applied!");

  } else {
    return false;
  }

  // Calculate two-point calibration
  // Map voltage range to pH range
  calculateTwoPointCalibration(
    ph_cal.point1_voltage, ph_cal.point1_ph,
    ph_cal.point2_voltage, ph_cal.point2_ph,
    ph_cal.slope, ph_cal.offset
  );

  saveCalibrationData();
  return true;
}


